import axios from "axios";

const myKey = import.meta.env.VITE_NOTEHUB_TOKEN;

// Інтерфейси, які описують відповіді http-запитів (FetchNotesResponse і т.д.)
// та параметри функцій, які виконують http-запити у — src/services/noteService.ts.

// Функції для виконання HTTP-запитів винесіть в окремий файл src/services/noteService.ts.
// Типізуйте їх параметри, результат, який вони повертають, та відповідь від Axios.
// У вас мають бути наступні функції:

// fetchNotes : має виконувати запит для отримання колекції нотаток із сервера.
// Повинна підтримувати пагінацію (через параметр сторінки) та фільтрацію за ключовим словом (пошук);

// createNote: має виконувати запит для створення нової нотатки на сервері.
// Приймає вміст нової нотатки та повертає створену нотатку у відповіді;

// deleteNote: має виконувати запит для видалення нотатки за заданим ідентифікатором.
// Приймає ID нотатки та повертає інформацію про видалену нотатку у відповіді.
